In [1]:
import mysql.connector #import mysql for use

In [2]:
mydb=mysql.connector.connect(host='localhost',   #make connection
                             user='root',
                             password='1234',
                             database='assign1')

In [3]:
mycursor=mydb.cursor() #create cursor

In [4]:
mycursor.execute("SHOW TABLES") #execute query

In [5]:
list(mycursor) #table in database

[('department',), ('employee',)]

In [6]:
query='''INSERT INTO employee(emp_id,f_name,l_name,age,gender,salary,city,dept)   
         VALUES(%s,%s,%s,%s,%s,%s,%s,%s)'''   # insert values
val=(101,'Asha','john',21,'Female',100000,'Bangalore','IT')
mycursor.execute(query,val)

In [7]:
mycursor.execute("SELECT * FROM employee") # get values from table
list(mycursor)

[(101, 'Asha', 'john', 21, 'Female', 100000, 'Bangalore', 'IT')]

In [8]:
query='''INSERT INTO employee(emp_id,f_name,l_name,age,gender,salary,city,dept)
         VALUES(%s,%s,%s,%s,%s,%s,%s,%s)'''  #insertmany values into table
val=[(102,'Ash','john',22,'male',100000,'surat','IT'),
     (103,'Aish','john',23,'female',200000,'Bangalore','HR'),
     (104,'Ashi','johann',28,'male',500000,'Kolkata','Finance'),
     (105,'Akshay','menon',32,'male',100000,'pune','marketing'),
     (106,'Akash','sune',29,'male',100000,'chennai','IT'),
     (107,'pooja','kumar',25,'female',100000,'Bangalore','Banking'),
     (108,'sagar','raju',35,'male',200000,'Bangalore','finance')]
mycursor.executemany(query,val)

In [9]:
mycursor.execute("SELECT * FROM employee")  #get values from table
for row in mycursor:
    print(row)

(101, 'Asha', 'john', 21, 'Female', 100000, 'Bangalore', 'IT')
(102, 'Ash', 'john', 22, 'male', 100000, 'surat', 'IT')
(103, 'Aish', 'john', 23, 'female', 200000, 'Bangalore', 'HR')
(104, 'Ashi', 'johann', 28, 'male', 500000, 'Kolkata', 'Finance')
(105, 'Akshay', 'menon', 32, 'male', 100000, 'pune', 'marketing')
(106, 'Akash', 'sune', 29, 'male', 100000, 'chennai', 'IT')
(107, 'pooja', 'kumar', 25, 'female', 100000, 'Bangalore', 'Banking')
(108, 'sagar', 'raju', 35, 'male', 200000, 'Bangalore', 'finance')

In [10]:
query='''UPDATE employee
         SET city='Hyderabad'
         WHERE f_name='sagar' and l_name='raju' '''  #update value in table
mycursor.execute(query)

In [11]:
mycursor.execute("SELECT * FROM employee")  #get values from table and check updated value
for row in mycursor:
    print(row)

(101, 'Asha', 'john', 21, 'Female', 100000, 'Bangalore', 'IT')
(102, 'Ash', 'john', 22, 'male', 100000, 'surat', 'IT')
(103, 'Aish', 'john', 23, 'female', 200000, 'Bangalore', 'HR')
(104, 'Ashi', 'johann', 28, 'male', 500000, 'Kolkata', 'Finance')
(105, 'Akshay', 'menon', 32, 'male', 100000, 'pune', 'marketing')
(106, 'Akash', 'sune', 29, 'male', 100000, 'chennai', 'IT')
(107, 'pooja', 'kumar', 25, 'female', 100000, 'Bangalore', 'Banking')
(108, 'sagar', 'raju', 35, 'male', 200000, 'Hyderabad', 'finance')

In [13]:
query='''UPDATE employee
         SET city='kanpur',l_name='hegde'
         WHERE f_name='pooja' '''  #update value 
mycursor.execute(query)

In [14]:
mycursor.execute("SELECT * FROM employee")  #check updated value
for row in mycursor:
    print(row)

(101, 'Asha', 'john', 21, 'Female', 100000, 'Bangalore', 'IT')
(102, 'Ash', 'john', 22, 'male', 100000, 'surat', 'IT')
(103, 'Aish', 'john', 23, 'female', 200000, 'Bangalore', 'HR')
(104, 'Ashi', 'johann', 28, 'male', 500000, 'Kolkata', 'Finance')
(105, 'Akshay', 'menon', 32, 'male', 100000, 'pune', 'marketing')
(106, 'Akash', 'sune', 29, 'male', 100000, 'chennai', 'IT')
(107, 'pooja', 'hegde', 25, 'female', 100000, 'kanpur', 'Banking')
(108, 'sagar', 'raju', 35, 'male', 200000, 'Hyderabad', 'finance')

In [19]:
mycursor.execute("DELETE FROM employee WHERE f_name='aish'")  #delete row from table

In [20]:
mycursor.execute("SELECT * FROM employee") #check whether row is deleted
for row in mycursor:
    print(row)

(101, 'Asha', 'john', 21, 'Female', 100000, 'Bangalore', 'IT')
(102, 'Ash', 'john', 22, 'male', 100000, 'surat', 'IT')
(104, 'Ashi', 'johann', 28, 'male', 500000, 'Kolkata', 'Finance')
(105, 'Akshay', 'menon', 32, 'male', 100000, 'pune', 'marketing')
(106, 'Akash', 'sune', 29, 'male', 100000, 'chennai', 'IT')
(107, 'pooja', 'hegde', 25, 'female', 100000, 'kanpur', 'Banking')
(108, 'sagar', 'raju', 35, 'male', 200000, 'Hyderabad', 'finance')

In [21]:
mydb.commit() #close connection
mydb.close()